isisbarajas/Proyecto2IsisBarajas/MKL25Z128xxx4_Proyecto2Semaforo/source/MKL25Z128xxx4_Proyecto2Semaforo.c
				if(TPM1->STATUS & mascara){
					TPM1->STATUS &=mascara_Off;
					contador=contador+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}

			}while(contador<=9);
			contador=0;
			estado=4;
    	break;

    	case 4:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[4].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}
			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<8u);
				Timer_init=0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				if(estado_reg==0){
					estado=5;
				}else if(estado_reg==1){
					estado=29;
				}
			}
		break;

    	case 5:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[5].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<8u);
				Timer_init=0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;

				if(ESensor_reg == 1 && OSensor_reg==1){
					estado_reg=0;
					ESensor_reg = 1;
					OSensor_reg = 1;
					estado = 6;
				}else if(ESensor_reg == 0 && OSensor_reg==1){
					ESensor_reg = 1;
					OSensor_reg = 1;
					estado = 19;
				}else if(ESensor_reg == 1 && OSensor_reg==0){
					ESensor_reg = 1;
					OSensor_reg = 1;
					estado = 24;
				}else if(OSensor_reg == 0 && ESensor_reg==0){
					ESensor_reg = 1;
					OSensor_reg = 1;
					estado_reg=1;
					estado = 7;
				}
			}
		break;

    	case 6:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[6].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}
			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<8u);
				Timer_init=0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado=7;
			}
		break;

    	case 7:
    		estadoactual=estado;
			do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOC, 1u<<5u);
				GPIO_TogglePinsOutput(GPIOA, 1u<<4u);
				while(!(TPM1->STATUS & mascara)){
				}

				if(TPM1->STATUS & mascara){
					TPM1->STATUS &=mascara_Off;
					contador=contador+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}

			}while(contador<=9);
			contador=0;
			estado=8;
    	break;

    	case 8:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[8].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}
			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<8u);
				Timer_init=0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				if(estado_reg==0){
					estado=1;
				}else if(estado_reg==1){
					estado=31;
				}
			}
    	break;
      	case 9:
    		estadoactual=estado;
    		do{
    			TPM_SetTimerPeriod(TPM1, 64u);
    			TPM_StartTimer(TPM1, kTPM_SystemClock);
    			GPIO_TogglePinsOutput(GPIOE, 1u<<20u);
    			while(!(TPM1->STATUS & mascara)){
    			}

    			if(TPM1->STATUS & mascara){
    				TPM1->STATUS &= mascara_Off;
    				contador=contador+1;
    				TPM_StopTimer(TPM1);
    				TPM1->CNT=0;
    			}
    		}while(contador<=9);
    		contador=0;
    		estado=10;
    	break;

    	case 10:
    		estadoactual=estado;
    		if(Timer_init==0){
    			Timer_init=1;
    			TPM_SetTimerPeriod(TPM0, FSM[10].TIMER_MOD);
    			TPM_StartTimer(TPM0, kTPM_SystemClock);
    		}

    		if(timerBandera){
    			TPM_ClearStatusFlags(TPM0, 1u<<8u);
    			Timer_init= 0;
    			TPM_StopTimer(TPM0);
    			TPM0->CNT=0;
    			estado= 11;
    		}
    	break;

    	case 11:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[11].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 12;
			}
    	break;

    	case 12:
    		estadoactual=estado;
    		do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOB, 1u<<0u);
				GPIO_TogglePinsOutput(GPIOB, 1u<<3u);
				while(!(TPM1->STATUS & mascara)){
				}

				if(TPM1->STATUS & mascara){
					TPM1->STATUS &= mascara_Off;
					contador=contador+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}
			}while(contador<=9);
			contador=0;
			estado=13;
		break;
    	case 13:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[13].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 5;
			}
    	break;
    	case 14:
    		estadoactual=estado;
    		do{
    			TPM_SetTimerPeriod(TPM1, 64u);
    			TPM_StartTimer(TPM1, kTPM_SystemClock);
    			GPIO_TogglePinsOutput(GPIOB, 1u<<0u);
    			while(!(TPM1->STATUS & mascara)){
    			}
    			if(TPM1->STATUS & mascara){
    				TPM1->STATUS &= mascara_Off;
    				contador=contador+1;
    				TPM_StopTimer(TPM1);
    				TPM1->CNT=0;
    			}
    		}while(contador<=9);
    		contador=0;
    		estado=15;
    	break;
    	case 15:
    		estadoactual=estado;
    		if(Timer_init==0){
    			Timer_init=1;
    			TPM_SetTimerPeriod(TPM0, FSM[15].TIMER_MOD);
    			TPM_StartTimer(TPM0, kTPM_SystemClock);
    		}

    		if(timerBandera){
    			TPM_ClearStatusFlags(TPM0, 1u<<8u);
    			Timer_init= 0;
    			TPM_StopTimer(TPM0);
    			TPM0->CNT=0;
    			estado= 16;
    		}
    	break;

    	case 16:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[11].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 17;
			}
    	break;
    	case 17:
    		estadoactual=estado;
    		do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOE, 1u<<20u);
				GPIO_TogglePinsOutput(GPIOE, 1u<<23u);
				while(!(TPM1->STATUS & mascara)){
				}

