isisbarajas/Proyecto2IsisBarajas/MKL25Z128xxx4_Proyecto2Semaforo/source/MKL25Z128xxx4_Proyecto2Semaforo.c
				if(TPM1->STATUS & mascara){
					TPM1->STATUS &= mascara_Off;
					contador=contador+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}
			}while(contador<=9);
			contador=0;
			estado=18;
		break;

    	case 18:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[18].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}
			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 5;
			}
    	break;
      	case 19:
    		estadoactual=estado;
    		do{
    			TPM_SetTimerPeriod(TPM1, 64u);
    			TPM_StartTimer(TPM1, kTPM_SystemClock);
    			GPIO_TogglePinsOutput(GPIOA, 1u<<4u);
    			while(!(TPM1->STATUS & mascara)){
    			}
    			if(TPM1->STATUS & mascara){
    				TPM1->STATUS &= mascara_Off;
    				contador=contador+1;
    				TPM_StopTimer(TPM1);
    				TPM1->CNT=0;
    			}
    		}while(contador<=9);
    		contador=0;
    		estado=20;
    	break;
    	case 20:
    		estadoactual=estado;
    		if(Timer_init==0){
    			Timer_init=1;
    			TPM_SetTimerPeriod(TPM0, FSM[20].TIMER_MOD);
    			TPM_StartTimer(TPM0, kTPM_SystemClock);
    		}
    		if(timerBandera){
    			TPM_ClearStatusFlags(TPM0, 1u<<8u);
    			Timer_init= 0;
    			TPM_StopTimer(TPM0);
    			TPM0->CNT=0;
    			estado= 21;
    		}
    	break;
    	case 21:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[21].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}

			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 22;
			}
    	break;
    	case 22:
    		estadoactual=estado;
    		do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOC, 1u<<5u);
				GPIO_TogglePinsOutput(GPIOC, 1u<<0u);
				while(!(TPM1->STATUS & mascara)){
				}
				if(TPM1->STATUS & mascara){
					TPM1->STATUS &= mascara_Off;
					contador=contador+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}
			}while(contador<=9);
			contador=0;
			estado=23;
		break;
    	case 23:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[23].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}
			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 1;
			}
    	break;
    	case 24:
    		estadoactual=estado;
    		do{
    			TPM_SetTimerPeriod(TPM1, 64u);
    			TPM_StartTimer(TPM1, kTPM_SystemClock);
    			GPIO_TogglePinsOutput(GPIOC, 1u<<5u);
    			while(!(TPM1->STATUS & mascara)){
    			}

    			if(TPM1->STATUS & mascara){
    				TPM1->STATUS &= mascara_Off;
    				contador=contador+1;
    				TPM_StopTimer(TPM1);
    				TPM1->CNT=0;
    			}
    		}while(contador<=9);
    		contador=0;
    		estado=25;
    	break;
    	case 25:
    		estadoactual=estado;
    		if(Timer_init==0){
    			Timer_init=1;
    			TPM_SetTimerPeriod(TPM0, FSM[25].TIMER_MOD);
    			TPM_StartTimer(TPM0, kTPM_SystemClock);
    		}
    		if(timerBandera){
    			TPM_ClearStatusFlags(TPM0, 1u<<8u);
    			Timer_init= 0;
    			TPM_StopTimer(TPM0);
    			TPM0->CNT=0;
    			estado= 26;
    		}
    	break;
    	case 26:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[16].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}
			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 27;
			}
    	break;
    	case 27:
    		estadoactual=estado;
    		do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOA, 1u<<4u);
				GPIO_TogglePinsOutput(GPIOA, 1u<<2u);
				while(!(TPM1->STATUS & mascara)){
				}
					if(TPM1->STATUS & mascara){
						TPM1->STATUS &= mascara_Off;
						contador=contador+1;
						TPM_StopTimer(TPM1);
						TPM1->CNT=0;
					}
			}while(contador<=9);
			contador=0;
			estado=28;
		break;
    	case 28:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[28].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}
			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 1;
			}
    	break;
    	case 29:
    		estadoactual=estado;
    		if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[29].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}
			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 30;
			}
    	break;
    	case 30:
    		estadoactual=estado;
    		do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOB, 1u<<3u);
				GPIO_TogglePinsOutput(GPIOE, 1u<<23u);
				while(!(TPM1->STATUS & mascara)){
				}
				if(TPM1->STATUS & mascara){
					TPM1->STATUS &= mascara_Off;
					contador=contador+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}
			}while(contador<=9);
			contador=0;
			estado_reg=0;
			estado=4;
    	break;
    	case 31:
    		estadoactual=estado;
			if(Timer_init==0){
				Timer_init=1;
				TPM_SetTimerPeriod(TPM0, FSM[31].TIMER_MOD);
				TPM_StartTimer(TPM0, kTPM_SystemClock);
			}
			if(timerBandera){
				TPM_ClearStatusFlags(TPM0, 1u<<8u);
				Timer_init= 0;
				TPM_StopTimer(TPM0);
				TPM0->CNT=0;
				estado= 32;
			}
		break;
		case 32:
			estadoactual=estado;
			do{
				TPM_SetTimerPeriod(TPM1, 64u);
				TPM_StartTimer(TPM1, kTPM_SystemClock);
				GPIO_TogglePinsOutput(GPIOC, 1u<<0u);
				GPIO_TogglePinsOutput(GPIOA, 1u<<2u);
				while(!(TPM1->STATUS & mascara)){
				}
				if(TPM1->STATUS & mascara){
					TPM1->STATUS &= mascara_Off;
					contador=contador+1;
					TPM_StopTimer(TPM1);
					TPM1->CNT=0;
				}
			}while(contador<=9);
			contador=0;
			estado_reg=0;
			estado=8;
		break;
    	}
    }
}
